export const questionsData = {
    easy: [
        {
            question: "Що з цього потрібно для крафту факела?",
            answers: ["Вугілля та палиця", "Камінь та дерево", "Кремінь та залізо", "Дошки та редстоун"],
            correct: 0,
        },
        {
            question: "Який інструмент найшвидше копає землю та пісок?",
            answers: ["Кирка", "Сокира", "Лопата", "Мотика"],
            correct: 2,
        },
        {
            question: "Яких тварин найбільше бояться кріпери?",
            answers: ["Вовків", "Котів", "Коней", "Папуг"],
            correct: 1,
        },
        {
            question: "З якого моба можна отримати шерсть для ліжка?",
            answers: ["Корова", "Свиня", "Курка", "Вівця"],
            correct: 3,
        }
    ],
    medium: [
        {
            question: "Скільки блоків обсидіану потрібно для найменшого порталу в Незер?",
            answers: ["8", "10", "12", "14"],
            correct: 1,
        },
        {
            question: "За допомогою чого можна приручити дикого вовка?",
            answers: ["Кістка", "Сире м'ясо", "Сира риба", "Пшениця"],
            correct: 0,
        },
        {
            question: "Які матеріали потрібні для створення компаса?",
            answers: ["Золото та редстоун", "Алмази та залізо", "Залізо та редстоун", "Мідь та вугілля"],
            correct: 2,
        },
        {
            question: "Як називається бос, якого викликають за допомогою піску душ і голів?",
            answers: ["Ендер Дракон", "Варден", "Візер (Іссушитель)", "Стародавній страж"],
            correct: 2,
        }
    ],
    hard: [
        {
            question: "Скільки Очей Краю максимально потрібно для активації порталу в Енд?",
            answers: ["8", "10", "14", "12"],
            correct: 3,
        },
        {
            question: "Що потрібно для крафту Маяка?",
            answers: ["Алмази, скло, обсидіан", "Зірка Незеру, скло, обсидіан", "Око Краю, скло, камінь", "Золото, зірка Незеру, бедрок"],
            correct: 1,
        },
        {
            question: "Який моб накладає на гравця ефект Втома від копання?",
            answers: ["Стародавній страж", "Відьма", "Фантом", "Шалкер"],
            correct: 0,
        },
        {
            question: "Який блок притягує до себе блискавки під час грози?",
            answers: ["Залізний блок", "Громовідвід", "Мідний блок", "Золотий блок"],
            correct: 1,
        }
    ],
    ultrahard: [
        {
            question: "Скільки досвіду випадає з Дракона Краю при першому вбивстві?",
            answers: ["50 рівнів", "64 рівні", "78 рівнів", "100' рівнів"],
            correct: 2,
        },
        {
            question: "Яка міцність у блоків обсидіану та ендер-скринь?",
            answers: ["600", "1200", "1800", "2400"],
            correct: 1,
        },
        {
            question: "Яка максимальна швидкість польоту на елітрах за допомогою ракет?",
            answers: ["33.5 м/с", "45.0 м/с", "66.2 м/с", "80.5 м/с"],
            correct: 0,
        },
        {
            question: "Скільки всього має подвійна скриння слотів для предметв?",
            answers: ["46 слотів", "49 слота", "54 слота", "56 слота"],
            correct: 2,
        },
        {
            question: "Який шанс випадіння голови скелета-візера без чарів на меч?",
            answers: ["2.1%", "2.5%", "2.7%", "3.1%"],
            correct: 1,
        }
    ],
};